app/controllers/posts_controller.rb

  def index
    respond_with Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author_id", "content", "created_at", "date", "description", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"